Revit 2024 API
MultiReferenceAnnotationOptions.DimensionLineOrigin Property
 The origin point for the dimension line.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public XYZ DimensionLineOrigin { get; set; }
Visual Basic
Public Property DimensionLineOrigin As XYZ
	Get
	Set
Visual C++
public:
property XYZ^ DimensionLineOrigin {
	XYZ^ get ();
	void set (XYZ^ value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
MultiReferenceAnnotationOptions Class
Autodesk.Revit.DB Namespace